Prathmesh07123/deepflux-mix01/firmware/f103/deepflux-mix-01-midi-proto/Middlewares/ST/STM32_USB_Device_Library/Class/MIDI/Src/usbd_midi.c
/**
  ******************************************************************************
  * @file    usbd_midi.c
  ******************************************************************************

    (CC at)2016 by D.F.Mac. @TripArts Music

*/ 

/* Includes ------------------------------------------------------------------*/
#include "usbd_midi.h"
#include "usbd_desc.h"
#include "usbd_ctlreq.h"
#include "stm32f1xx_hal.h"

static uint8_t  USBD_MIDI_Init (USBD_HandleTypeDef *pdev, uint8_t cfgidx);
static uint8_t  USBD_MIDI_DeInit (USBD_HandleTypeDef *pdev, uint8_t cfgidx);
static uint8_t  USBD_MIDI_DataIn (USBD_HandleTypeDef *pdev, uint8_t epnum);
static uint8_t  USBD_MIDI_DataOut (USBD_HandleTypeDef *pdev, uint8_t epnum);

static uint8_t  *USBD_MIDI_GetCfgDesc (uint16_t *length);
//uint8_t  *USBD_MIDI_GetDeviceQualifierDescriptor (uint16_t *length);
USBD_HandleTypeDef *pInstance = NULL; 

volatile uint32_t APP_Rx_ptr_in  = 0;
volatile uint32_t APP_Rx_ptr_out = 0;
volatile uint32_t APP_Rx_length  = 0;

volatile uint8_t  USB_Tx_State = 0;
volatile uint32_t APP_Tx_ptr_in  = 0;
volatile uint32_t APP_Tx_ptr_out = 0;
volatile uint32_t APP_Tx_length  = 0;

__ALIGN_BEGIN uint8_t USB_Rx_Buffer[APP_RX_DATA_SIZE] __ALIGN_END ;
__ALIGN_BEGIN uint8_t APP_Tx_Buffer[APP_TX_DATA_SIZE] __ALIGN_END ;

/* USB Standard Device Descriptor */
/*
__ALIGN_BEGIN static uint8_t USBD_MIDI_DeviceQualifierDesc[USB_LEN_DEV_QUALIFIER_DESC] __ALIGN_END =
{
  USB_LEN_DEV_QUALIFIER_DESC,
  USB_DESC_TYPE_DEVICE_QUALIFIER,
  0x00,
  0x02,
  0x00,
  0x00,
  0x00,
  0x40,
  0x01,
  0x00,
};
*/

/* USB MIDI interface class callbacks structure */
USBD_ClassTypeDef  USBD_MIDI = 
{
  USBD_MIDI_Init,
  USBD_MIDI_DeInit,
  NULL,
  NULL,
  NULL,
  USBD_MIDI_DataIn,
  USBD_MIDI_DataOut,
  NULL,
  NULL,
  NULL,
  NULL,// HS
  USBD_MIDI_GetCfgDesc,// FS
  NULL,// OTHER SPEED
  NULL,// DEVICE_QUALIFIER
};

/* USB MIDI device Configuration Descriptor */
__ALIGN_BEGIN uint8_t USBD_MIDI_CfgDesc[USB_MIDI_CONFIG_DESC_SIZ] __ALIGN_END =
{
  // configuration descriptor
  0x09, 0x02, 0x65, 0x00, 0x02, 0x01, 0x00, 0x80, 0x31,

  // The Audio Interface Collection
  0x09, 0x04, 0x00, 0x00, 0x00, 0x01, 0x01, 0x00, 0x00, // Standard AC Interface Descriptor
  0x09, 0x24, 0x01, 0x00, 0x01, 0x09, 0x00, 0x01, 0x01, // Class-specific AC Interface Descriptor
  0x09, 0x04, 0x01, 0x00, 0x02, 0x01, 0x03, 0x00, 0x00, // MIDIStreaming Interface Descriptors
  0x07, 0x24, 0x01, 0x00, 0x01, 0x41, 0x00,             // Class-Specific MS Interface Header Descriptor

  // MIDI IN JACKS
  0x06, 0x24, 0x02, 0x01, 0x01, 0x00,
  0x06, 0x24, 0x02, 0x02, 0x02, 0x00,

  // MIDI OUT JACKS
  0x09, 0x24, 0x03, 0x01, 0x03, 0x01, 0x02, 0x01, 0x00,
  0x09, 0x24, 0x03, 0x02, 0x06, 0x01, 0x01, 0x01, 0x00,

  // OUT endpoint descriptor
  0x09, 0x05, MIDI_OUT_EP, 0x03, 0x10, 0x00, 0x01, 0x00, 0x00,
  0x05, 0x25, 0x01, 0x01, 0x01,

  // IN endpoint descriptor
  0x09, 0x05, MIDI_IN_EP, 0x03, 0x10, 0x00, 0x01, 0x00, 0x00,
  0x05, 0x25, 0x01, 0x01, 0x03,
};

static uint8_t USBD_MIDI_Init(USBD_HandleTypeDef *pdev, uint8_t cfgidx){
	(void)cfgidx;
  pInstance = pdev;
  USBD_LL_OpenEP(pdev,MIDI_IN_EP,USBD_EP_TYPE_INTR,MIDI_DATA_IN_PACKET_SIZE);
  USBD_LL_OpenEP(pdev,MIDI_OUT_EP,USBD_EP_TYPE_INTR,MIDI_DATA_OUT_PACKET_SIZE);
  USBD_LL_PrepareReceive(pdev,MIDI_OUT_EP,(uint8_t*)(USB_Rx_Buffer),MIDI_DATA_OUT_PACKET_SIZE);
  return 0;
}

static uint8_t USBD_MIDI_DeInit (USBD_HandleTypeDef *pdev, uint8_t cfgidx){
	(void)cfgidx;
  pInstance = NULL;
  USBD_LL_CloseEP(pdev,MIDI_IN_EP);
  USBD_LL_CloseEP(pdev,MIDI_OUT_EP);
  return 0;
}

static uint8_t USBD_MIDI_DataIn (USBD_HandleTypeDef *pdev, uint8_t epnum){
	(void)pdev;
	(void)epnum;
	USB_Tx_State = 0;

  return USBD_OK;
}

static uint8_t USBD_MIDI_DataOut (USBD_HandleTypeDef *pdev, uint8_t epnum)
{      
  uint16_t USB_Rx_Cnt;

  USBD_MIDI_ItfTypeDef *pmidi;
  pmidi = (USBD_MIDI_ItfTypeDef *)(pdev->pUserData);


  epnum &= 0x7F;
  USB_Rx_Cnt = ((PCD_HandleTypeDef*)pdev->pData)->OUT_ep[epnum].xfer_count;

  if (pmidi && pmidi->pIf_MidiRx)
  {
      pmidi->pIf_MidiRx((uint8_t *)USB_Rx_Buffer, USB_Rx_Cnt);
  }
//  pmidi->pIf_MidiTx((uint8_t*)&USB_Rx_Cnt, 2);

//  for(uint8_t i = 0; i < USB_Rx_Cnt; i++) USB_Rx_Buffer[i] = 0;

  USBD_LL_PrepareReceive(pdev,MIDI_OUT_EP,(uint8_t*)&(USB_Rx_Buffer),MIDI_DATA_OUT_PACKET_SIZE);
  return USBD_OK;
}

uint8_t USBD_MIDI_SendPacket (){
	uint16_t USB_Tx_ptr;
	uint16_t USB_Tx_length;
	uint8_t result = USBD_OK;
	if(USB_Tx_State != 1) {
		if(APP_Tx_ptr_out == APP_TX_DATA_SIZE) {
			APP_Tx_ptr_out = 0;
		}
		if(APP_Tx_ptr_out == APP_Tx_ptr_in) {
			USB_Tx_State = 0;
			return USBD_OK;
		}
		if(APP_Tx_ptr_out > APP_Tx_ptr_in) {
			APP_Tx_length = APP_TX_DATA_SIZE - APP_Tx_ptr_out;
		}
		else {
			APP_Tx_length = APP_Tx_ptr_in - APP_Tx_ptr_out;
		}
		if(APP_Tx_length > MIDI_DATA_IN_PACKET_SIZE) {
			USB_Tx_ptr = APP_Tx_ptr_out;
			USB_Tx_length = MIDI_DATA_IN_PACKET_SIZE;
			APP_Tx_ptr_out += MIDI_DATA_IN_PACKET_SIZE;
			APP_Tx_length -= MIDI_DATA_IN_PACKET_SIZE;
		}
		else {
			USB_Tx_ptr = APP_Tx_ptr_out;
			USB_Tx_length = APP_Tx_length;
			APP_Tx_ptr_out += APP_Tx_length;
			APP_Tx_length = 0;
		}
		USB_Tx_State = 1;
		result = USBD_LL_Transmit(pInstance,MIDI_IN_EP,(uint8_t*)&APP_Tx_Buffer[USB_Tx_ptr],USB_Tx_length);
	}
	else {
		return USBD_BUSY;
	}
	return result;
}

uint8_t USBD_MIDI_Send(uint8_t *buf, uint16_t len)
{
  if (!buf || len == 0 || len > APP_TX_DATA_SIZE)
    return USBD_FAIL;

  for (uint16_t i = 0; i < len; i++)
  {
    APP_Tx_Buffer[APP_Tx_ptr_in++] = buf[i];
    APP_Tx_ptr_in %= APP_TX_DATA_SIZE;
  }

  return USBD_MIDI_SendPacket();
}


static uint8_t *USBD_MIDI_GetCfgDesc (uint16_t *length){
  *length = sizeof (USBD_MIDI_CfgDesc);
  return USBD_MIDI_CfgDesc;
}

//uint8_t *USBD_MIDI_GetDeviceQualifierDescriptor (uint16_t *length){
//  *length = sizeof (USBD_MIDI_DeviceQualifierDesc);
//  return USBD_MIDI_DeviceQualifierDesc;
//}

uint8_t USBD_MIDI_RegisterInterface(USBD_HandleTypeDef *pdev, USBD_MIDI_ItfTypeDef *fops)
{
  uint8_t ret = USBD_FAIL;
  
  if(fops != NULL){
    pdev->pUserData= fops;
    ret = USBD_OK;    
  }
  
  return ret;
}
